emacs/.emacs.d/emacs.org
#+title: A Literate Emacs Setup
#+author: Frank Patz-Brockmann, {{{email}}}
#+email: fpatz@acm.org
#+date: Updated January 2023
#+language: en
#+options: toc:3

# -- Setting up Org Babel to suppress results from source blocks. This
# -- is useful to avoid polluting this document with #+RESULT blocks
# -- when evaluating source blocks with C-c C-c to update Emacs
#+property: header-args :results silent :tangle yes :noweb no-export

* Literate Programming

  {{{index(literate programming)}}}

  #+begin_dropcap
  My Emacs setup lives in ~.emacs.d/emacs.org~ as a /literate program/
  cite:knuth1984literate, that is in an Org Mode cite:orgmode text
  document with embedded [[https://www.gnu.org/software/emacs/manual/elisp.html][Emacs Lisp]] (and other) code snippets. What
  you're reading here is produced from that document. The process of
  extracting code from a literate program is called "tangling".
  #+end_dropcap

  {{{index(tangling)}}}

  In this document, code that is part of the Emacs configuration is
  typeset like this -- the following also is the first line of the
  initialization (see [[info:Elisp#Using Lexical Binding][Elisp, lexical binding]]).

  #+begin_src emacs-lisp
    ;; -*- lexical-binding: t; -*-
    ;; This is emacs.el and it is generated from emacs.org.
  #+end_src

  Source code that is /not/ part of the initialization but gets
  tangled into another file or is a [[info:org#Noweb Reference Syntax][noweb]] definition has a
  little annotation on top of it:

  {{{tag(annotation)}}}
  #+attr_html: :class tagged
  #+begin_src emacs-lisp :tangle no
    (do-some-thing-else)
  #+end_src

  {{{index(Git repository)}}}

  The Emacs configuration files in ~.emacs.d~ are under version
  control in a Git repository
  (https://git.contact.de/frank/dotemacs). That repository is meant to
  provide a reproducible Emacs setup: on a new machine, I can clone
  the repository into ~.emacs.d/~. When Emacs is started for the
  first time, all required packages will be installed automatically.

* Initialization

** ~init.el~

   {{{index(init.el@\texttt{init.el})}}}
   {{{index(initialization file)}}}

   When Emacs is started, it loads a lisp program from an
   [[info:emacs#Init File][initialization file]]. That program is meant
   to initialize Emacs in the way you want it, i.e. load extensions, set
   custom options etc. I prefer to have all things related to Emacs in
   one folder, ~.emacs.d/~, and use ~init.el~ in that folder as my
   initialization file (there are other options, though).

   Emacs cannot run the literate program in ~emacs.org~
   directly. Instead, ~init.el~ is generated from a special section in
   this file, and the code in ~init.el~ uses an Org Mode function to
   extract the Lisp code from ~emacs.org~ and execute it.

   {{{index(garbage collection)}}}

   Here is ~init.el~. While running the code from ~emacs.org~, it sets
   the garbage collection thresholds to higher values to improve
   startup time a bit.

   # When changing the code in this source block, don't forget to
   # update ~.emacs.d/init.el by tangling it (C-c C-v C-t)!
   {{{tag(init.el)}}}
   #+begin_src emacs-lisp :tangle init.el
     ;; This is init.el, and it is generated from emacs.org!

     ;; Install straight.el
     (defvar bootstrap-version)
     (let ((bootstrap-file
            (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
           (bootstrap-version 5))
       (unless (file-exists-p bootstrap-file)
         (with-current-buffer
             (url-retrieve-synchronously
              "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
              'silent 'inhibit-cookies)
           (goto-char (point-max))
           (eval-print-last-sexp)))
       (load bootstrap-file nil 'nomessage))

     ;; Initialize Emacs by loading the literate Lisp in emacs.org -- we
     ;; want a fresh 'org for that, so we'll make sure, 'straight has it
     ;; loaded. During initialization, inhibit garbage collection.

     (setq gc-cons-threshold most-positive-fixnum
           gc-cons-percentage 0.9)

     (straight-use-package 'org)
     (require 'org)

     (let ((previous-vc-follow vc-follow-symlinks))
       (progn
         (setq vc-follow-symlinks nil)
         (org-babel-load-file "~/.emacs.d/emacs.org")
         (setq vc-follow-symlinks previous-vc-follow)))

     (setq gc-cons-threshold 16777216
           gc-cons-percentage 0.1)
   #+end_src

   {{{tag(early-init.el)}}}
   #+begin_src emacs-lisp :tangle early-init.el
     ;; Disable package.el in favor of straight.el
     (setq package-enable-at-startup nil)
     (message "I am early init!")
   #+end_src

   We have to do this early.

   [[help:vc-handled-backends]]
   #+begin_src emacs-lisp
     (setq vc-handled-backends nil)
   #+end_src



** Measuring startup time

   {{{index(startup hook)}}}

   The following code adds a function to [[help:emacs-startup-hook]] that
   reports how much time was spent in Emacs initialization. Optimizing
   startup time seems to be a popular ambition among Emacsers. I don't
   care much, though, as I tend to run very long-lived Emacs sessions.

   #+begin_src emacs-lisp
     ;; Use a hook, so the message doesn't get clobbered by
     ;; other messages.
     (add-hook
      'emacs-startup-hook
      (lambda ()
        (message
         "Emacs ready in %s with %d garbage collections."
         (format "%.2f seconds"
                 (float-time
                  (time-subtract after-init-time before-init-time)))
         gcs-done)))
   #+end_src

** Bootstrapping ~use-package~

   {{{package(use-package)}}}

   For installing, loading and configuring Emacs packages, I use John
   Wiegley's [[https://github.com/jwiegley/use-package][use-package]] macro, which has many convenient features
   and makes handling packages a lot easier. ~use-package~ is not
   (yet) built into Emacs, and we obviously cannot use ~use-package~
   to install itself -- so we have to bootstrap it here using
   functions from ~package.el~:

   #+begin_src emacs-lisp
     ;; Install use-package
     (straight-use-package 'use-package)
   #+end_src

** ~with-system~ for platform-dependent code

   {{{index(with-system@\texttt{with-system} (macro))}}}

   Here is a macro ~with-system~ that can be used to run Lisp code on
   one particular platform only (copied from [[https://stackoverflow.com/questions/1817257/how-to-determine-operating-system-in-elisp/26137517#26137517][this smart StackOverflow
   answer]]). Emacs platforms include ~darwin~ (macOS), ~gnu/linux~ and
   ~windows-nt~. We'll use this macro later on for initializations
   that are specific to my Windows, macOS or Linux environments.

   #+begin_src emacs-lisp
     (defmacro with-system (type &rest body)
       "Evaluate BODY if `system-type' equals TYPE."
       (declare (indent defun))
       `(when (eq system-type ',type)
          ,@body))
   #+end_src

** The load path

   {{{index(load-path@\texttt{load-path})}}}

   I keep some home-grown lisp files in ~.emacs.d/lisp~, so add this
   path to ~load-path~:

   #+begin_src emacs-lisp
   (add-to-list 'load-path "~/.emacs.d/lisp")
   #+end_src

** Custom-less setup

   {{{index(custom-less)}}}

   Emacs has a built-in customization system: built-in and installable
   packages declare customizable properties, which users can
   manipulate via ~M-x customize~. The resulting custom settings are
   persisted into a file in ~.emacs.d/~ and automatically reloaded
   on startup. It is not a good idea to keep the custom file under
   version control, though, especially for a "roaming" configuration
   that is used on different machines and platforms.

   Therefore, I use a "custom-less" setup, i.e. all settings done via
   the ~customize~ user interface are temporary and will never be
   saved automatically. Permanent custom settings have to be made in
   /this/ file, ~emacs.org~, programmatically (e.g. in the ~:custom~
   section of a ~use-package~ form).

   {{{package(cus-edit)}}}

   #+begin_src emacs-lisp
     (use-package cus-edit
       :defer t
       :custom
       (custom-file null-device "Don't store customizations"))
   #+end_src


* Housekeeping

** Command History

   #+begin_src emacs-lisp
     (savehist-mode)
   #+end_src

** Backups

   Here we exert some control over the ways Emacs makes backups of
   files. We keep all backups in a dedicated dot directory in ~$HOME$~
   and force a short history.

   #+begin_src emacs-lisp
     (let ((backup-directory "~/.backups"))
       (make-directory backup-directory t)
       (setq backup-directory-alist `(("." . ,backup-directory))))
     (setq backup-by-copying t
           delete-old-versions t
           kept-new-versions 6
           kept-old-versions 2
           version-control t
           vc-make-backup-files t)
   #+end_src

** Locks

   Inhibit Emacs lock files, as they interfere with software scanning
   certain directories for new or changed files, e.g. the Hugo
   development server (this is more a problem of Hugo, though -- it
   simply crashes on finding an Emacs lock file in a content
   directory).

   I don't feel particularly well about this one, as it increases the
   risk of inadvertently overwriting files from another session, on
   the other hand I very rarely have more than one active Emacs
   session, and I never work on shared file systems from different
   machines.

   #+begin_src emacs-lisp
     (setq create-lockfiles nil)
   #+end_src


* Settings for macOS

  {{{index(macOS)}}}
  {{{index(system type!darwin@\texttt{darwin})}}}
  {{{index(darwin@\texttt{darwin})}}}

  The code blocks in this section go into the place marked with
  /mac-specific-code/ below via Org Mode's [[https://orgmode.org/manual/Noweb-Reference-Syntax.html][noweb feature]], i.e. inside
  the ~with-system~ macro, and thus only run on macOS systems.

  #+begin_src emacs-lisp
    (with-system darwin
      <<mac-specific-code>>
    )
  #+end_src

  {{{index(Spotlight)}}}
  {{{index(environment)}}}
  {{{index(environment variables)}}}
  {{{index(environment variable!PATH@\texttt{PATH})}}}
  {{{index(environment variable!LANG@\texttt{LANG})}}}

  On macOS, I usually launch Emacs from the graphical desktop via
  Spotlight. Applications launched that way do not inherit standard
  environment variables like ~PATH~ from the shell.
  [[https://github.com/purcell/exec-path-from-shell][~exec-path-from-shell~]] is a neat little package to do just that.

  {{{package(exec-path-from-shell)}}}

  {{{tag(«mac-specific-code»)}}}
  #+begin_src emacs-lisp :tangle no :noweb-ref mac-specific-code
    (setq exec-path-from-shell-arguments nil)
    (use-package exec-path-from-shell :straight t)
    (exec-path-from-shell-initialize)
    (setenv "LANG" "en_US.UTF-8")
  #+end_src

  {{{index(German keyboard)}}}
  {{{index(Meta key)}}}
  {{{index(Super key)}}}

  On my German keyboard I use the left Alt-key as Emacs' Meta. The
  right Alt-key is passed to macOS to make characters like umlauts
  accessible. Inside Emacs, I don't use traditional macOS keyboard
  shortcuts, so the Command-key can be used as Emacs Super. More
  detail is found [[https://stackoverflow.com/a/33599236/2278030][at this StackOverflow question]].

  Note that all this has no effect when running Emacs inside a
  Terminal. You'll have to use ESC there for Meta.

  {{{tag(«mac-specific-code»)}}}
  #+begin_src emacs-lisp :tangle no :noweb-ref mac-specific-code
    (setq mac-option-modifier 'meta)
    (setq mac-command-modifier 'super)
    (setq ns-right-alternate-modifier nil)
    (setq mac-right-option-modifier nil)
  #+end_src

  {{{index(Homebrew)}}}

  On macOS, I use [[https://brew.sh][Homebrew]] (a lot). Some Homebrew packages come with
  Emacs lisp packages, that are installed into the Homebrew directory
  ~/usr/local~. Each Homebrew package potentially has a subfolder
  there. The following Lisp code adds all those to ~load-path~, too:

  {{{tag(«mac-specific-code»)}}}
  #+begin_src emacs-lisp :tangle no :noweb-ref mac-specific-code
    (let ((homebrew-lisp "/usr/local/share/emacs/site-lisp/"))
      (if (file-directory-p homebrew-lisp)
          (let ((default-directory homebrew-lisp))
            (normal-top-level-add-subdirs-to-load-path))))
  #+end_src

* User Interface

