emacs/.emacs.d/emacs.el
(setq vc-handled-backends nil)

;; -*- lexical-binding: t; -*-
;; Use a hook, so the message doesn't get clobbered by
;; other messages.
(add-hook
 'emacs-startup-hook
 (lambda ()
   (message
    "Emacs ready in %s with %d garbage collections."
    (format "%.2f seconds"
            (float-time
             (time-subtract after-init-time before-init-time)))
    gcs-done)))

;; Install use-package
(straight-use-package 'use-package)

(defmacro with-system (type &rest body)
  "Evaluate BODY if `system-type' equals TYPE."
  (declare (indent defun))
  `(when (eq system-type ',type)
     ,@body))

(add-to-list 'load-path "~/.emacs.d/lisp")

(use-package cus-edit
  :defer t
  :custom
  (custom-file null-device "Don't store customizations"))

(savehist-mode)

(let ((backup-directory "~/.backups"))
  (make-directory backup-directory t)
  (setq backup-directory-alist `(("." . ,backup-directory))))
(setq backup-by-copying t
      delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t
      vc-make-backup-files t)

(setq create-lockfiles nil)

(with-system darwin
  (setq exec-path-from-shell-arguments nil)
  (use-package exec-path-from-shell :straight t)
  (exec-path-from-shell-initialize)
  (setenv "LANG" "en_US.UTF-8")
  (setq mac-option-modifier 'meta)
  (setq mac-command-modifier 'super)
  (setq ns-right-alternate-modifier nil)
  (setq mac-right-option-modifier nil)
  (let ((homebrew-lisp "/usr/local/share/emacs/site-lisp/"))
    (if (file-directory-p homebrew-lisp)
        (let ((default-directory homebrew-lisp))
          (normal-top-level-add-subdirs-to-load-path))))
