emacs/.emacs.d/emacs.org
** Fonts and Theme

  {{{index(theme)}}}
  {{{index(Material, theme)}}}
  {{{index(Fira Code, font)}}}

  I use a custom theme ~material-frank~, defined in
  [[file:material-frank-theme.el]] in this directory, and I use [[https://github.com/tonsky/FiraCode][Fira Code]]
  as my default font in Emacs.

  #+begin_src emacs-lisp
    (when (window-system)
      (set-frame-font "Fira Code")
      (set-face-attribute 'default nil :height 120)
      (load-theme 'material-frank t))
  #+end_src

  {{{index(ligatures)}}}

  Enable Fira Code ligatures, if this build of Emacs does support
  that.

  {{{tag(«mac-specific-code»)}}}
  #+begin_src emacs-lisp :tangle no :noweb-ref mac-specific-code
    (if (boundp 'mac-auto-operator-composition-mode)
        (mac-auto-operator-composition-mode))
  #+end_src

** Window Decoration

  {{{index(full screen)}}}
  {{{index(scrollbars)}}}
  {{{index(menu bar)}}}

  I prefer a stripped down, no scrollbars, no menu bar, full screen
  Emacs experience.

  #+begin_src emacs-lisp
    (when (window-system)
      (tool-bar-mode 0)
      (scroll-bar-mode 0)
      (menu-bar-mode 0)
      (set-frame-parameter nil 'fullscreen 'fullscreen))
  #+end_src

** Improved Info

   The {{{package(info+)}}} package improves Emacs Info by adding command and
   fontification.

   #+begin_src emacs-lisp
     (straight-use-package 'info+)
     (require 'info+)
   #+end_src

** Other

  No message in the ~*scratch*~ buffer.

  #+begin_src emacs-lisp
  (setq initial-scratch-message nil)
  #+end_src

  This enables [[help:org-support-shift-select][shift-select]].

  #+begin_src emacs-lisp
    (setq org-support-shift-select t)
  #+end_src

  I hate it, when Emacs beeps at me.

  #+begin_src emacs-lisp
    (setq visible-bell t)
    (setq ring-bell-function 'ignore)
  #+end_src

  Do /not/ wrap lines.

  #+begin_src emacs-lisp
    (setq visual-line-mode t)
  #+end_src

  Desktop save mode restores open buffers and some settings, but we
  exclude frame settings, those we did above.

  #+begin_src emacs-lisp
    (setq desktop-path '("~/.emacs.d"))
    (setq desktop-restore-frames nil)
    (desktop-save-mode 1)
  #+end_src

  Use a (slightly) pimped modeline, using ~powerline~ and
  ~spaceline~.

  {{{index(mode line)}}}
  {{{package(powerline)}}}
  {{{package(spaceline)}}}
  {{{package(spaceline-config)}}}

  #+begin_src emacs-lisp
    (use-package powerline :straight t)
    (use-package spaceline :straight t)
    (require 'spaceline-config)
    (spaceline-emacs-theme)
  #+end_src

  Use ~ibuffer~.

  #+begin_src emacs-lisp
    (global-set-key (kbd "C-x C-b") 'ibuffer)
  #+end_src


** Focus Mode

   {{{index(focused writing)}}}

   For focused writing I like to reduce the user interface even
   further by hiding Emacs's mode line and centering the text of the
   current buffer.

   {{{package(olivetti)}}}
   {{{package(hide-mode-line)}}}

   #+begin_src emacs-lisp
     (use-package olivetti :straight t)
     (use-package hide-mode-line :straight t)
   #+end_src

   My custom focus mode combines the ~olivetti~ and ~hide-mode-line~
   packages and is bound to ~S-o~.

   {{{binding(s-o,fp/focus-mode)}}}

   #+begin_src emacs-lisp
     (defun fp/focus-mode ()
       "Enter focused writing mode"
       (interactive)
       (progn
         (if (bound-and-true-p olivetti-mode)
             (progn
               (olivetti-mode 0)
               (hide-mode-line-mode 0))
           (progn
             (olivetti-mode 1)
             (hide-mode-line-mode 1)
             (olivetti-set-width 85)))))
     (global-set-key (kbd "C-c o") 'fp/focus-mode)
   #+end_src

** A fix for wonky fingers

   When trying to type ~C-x C-s~ (for ~save-buffer~) I sometimes miss
   the second control key, resulting in ~C-x s~ (for
   ~save-some-buffers~), which produces an annoying prompt
   interrupting my flow. To compensate for this, I simply rebind ~C-x
   s~ to also do ~save-buffer~.

   {{{binding(C-x s,save-buffer)}}}
   #+begin_src emacs-lisp
     (global-set-key (kbd "C-x s") 'save-buffer)
   #+end_src

* Minibuffer

  {{{package(vertico)}}}
  Use ~vertico~ for minibuffer completion. Also install all the
  extension files. We use ~vertico-directory-delete-char~ to enable
  quick directory-up like in ~ivy~.

  #+begin_src emacs-lisp
    (use-package vertico
      :straight (vertico :files (:defaults "extensions/*")
                         :includes (vertico-indexed
                                    vertico-flat
                                    vertico-grid
                                    vertico-mouse
                                    vertico-quick
                                    vertico-buffer
                                    vertico-repeat
                                    vertico-reverse
                                    vertico-directory
                                    vertico-multiform
                                    vertico-unobtrusive
                                    ))
      :bind (:map vertico-map
           ("DEL" . vertico-directory-delete-char)))
    (vertico-mode)
  #+end_src

  {{{package(orderless)}}}
  Use ~orderless~ completion styles.

  #+begin_src emacs-lisp
    (use-package orderless
      :straight t
      :custom
      (completion-styles '(orderless))      ; Use orderless
      (orderless-matching-styles
       '(orderless-literal
         orderless-prefixes
         orderless-initialism
         orderless-regexp
         orderless-flex                       ; Basically fuzzy finding
         ;; orderless-strict-leading-initialism
         ;; orderless-strict-initialism
         ;; orderless-strict-full-initialism
         ;; orderless-without-literal          ; Recommended for dispatches instead
         )))
  #+end_src

  {{{package(embark)}}}
  #+begin_src emacs-lisp
    (use-package embark
      :straight t
      :bind
      (("s-e" . embark-act)))
  #+end_src

  {{{package(marginalia)}}}
  #+begin_src emacs-lisp
  (use-package marginalia
    :straight t
    :config
    (marginalia-mode))
  #+end_src

  These don't really belong here ...
  {{{package(consult)}}}
  {{{package(which-key)}}}

  #+begin_src emacs-lisp
    (use-package consult :straight t)
    (use-package embark-consult :straight t)
  #+end_src

  #+begin_src emacs-lisp
    (use-package which-key :straight t :config (which-key-mode))
  #+end_src

* Org Mode

  Org Mode cite:orgmode is what I use most for taking notes and
  minutes or writing essays. My ~.org~ files simply go into a Dropbox
  folder, which makes it easy to synchronize between different
  computers and my smartphone.

  #+begin_src emacs-lisp
    (setq org-directory "~/Dropbox/org")
  #+end_src

  The Org files for filing to-do items and journal entry also are in
  this folder.

  #+begin_src emacs-lisp
    (setq org-default-notes-file (concat org-directory "/todo.org"))
    (setq org-default-journal-file (concat org-directory "/journal.org"))
  #+end_src

  The Org agenda comes from these files:

  #+begin_src emacs-lisp
    (setq org-agenda-files
          (list
           org-default-journal-file
           org-default-notes-file
           (concat org-directory "/inbox.org")))
  #+end_src

** To-do Keywords

   Org has a configurable life cycle for to-do items. I keep it
   simple.

   #+begin_src emacs-lisp
     (setq org-todo-keywords
           '((sequence "TODO" "|" "DONE" "CANCELLED")))
   #+end_src

   Insert a time stamp whenever a to-do item is completed.

   #+begin_src emacs-lisp
     (setq org-log-done 'time)
   #+end_src


** Capture

   {{{binding(C-c c,org-capture)}}}

   With Org, a to-do item or a journal entry (or anything else) can be
   "captured" from anywhere using the global key binding (~C-c
   c~). For each item type, a /template/ is defined. I just use to-do
   items and journal entries.

   {{{index(capture templates)}}}

   Here is my template for to-do items. It generates Prio "A" tasks,
   automatically adds the current day as a deadline, and creates a
   link to wherever I came from:

   {{{tag(«todo-template»)}}}
   #+name: todo-template
   #+begin_src org :tangle no
    ,* TODO [#A] %?
       %:url
       %a
   #+end_src

   The journal entry template is much less spectacular:

   {{{tag(«journal-template»)}}}
   #+name: journal-template
   #+begin_src emacs-lisp :tangle no
    ,* %?
   #+end_src

   Both templates go into ~org-capture-templates~:

   #+begin_src emacs-lisp
     (setq
        org-capture-templates
        '(
          ("t" "Todo Item"
           entry (file+headline org-default-notes-file "Tasks")
           "* TODO %?\n  %T\n\n  %a"
           :empty-lines 1)
          ("j" "Journal Entry"
           entry (file+olp+datetree org-default-journal-file)
           "* %:description%?\n  %T\n\n  %a\n  %l\n\n  %i"
           :empty-lines 1)))
   #+end_src

** Refile

   #+begin_src emacs-lisp
     (setq fp/snippets-file (concat org-directory "/snippets.org"))
     (setq fp/links-file (concat org-directory "/links.org"))
     (setq org-refile-targets
           `(((,fp/snippets-file) :maxlevel . 1)
             ((,fp/links-file) :maxlevel . 3)
             (org-agenda-files :maxlevel . 2)))
     (setq org-refile-allow-creating-parent-nodes 'confirm)
     (setq org-refile-use-outline-path 'file)
   #+end_src

** Deft

   {{{package(deft)}}}
   {{{binding(<f9>,deft)}}}

   A neat way to create and find notes is Jason Blevin's /Deft/
   cite:blevinsDeftEmacs2016, which is inspired by *Notational
   Velocity*: in Deft you simply start typing to find an existing note
   or create a new one. I keep my Deft notes as ~.org~ files in the
   Dropbox folder mentioned above. This way Deft can
   also be used to find other Org files in that folder.

   #+begin_src emacs-lisp
     (use-package deft
       :straight t
       :bind ("<f9>" . deft)
       :config
       (setq
        deft-extensions '("org" "txt" "rst" "md")
        deft-default-extension "org"
        deft-directory org-directory
        deft-use-filter-string-for-filename t
        ;; The following convienently makes Deft aware
        ;; of #+title lines in Org files
        deft-org-mode-title-prefix t))
   #+end_src

** Org User Interface

   Customize [[help:org-goto]] to use the completion interface:

   #+begin_src emacs-lisp
     (setq org-goto-interface 'outline-path-completion)
     (setq org-outline-path-complete-in-steps nil)
   #+end_src

   {{{package(org-bullets)}}}

   ~org-bullets~ creates pretty headlines.

   #+begin_src emacs-lisp
     (use-package org-bullets
        :straight t
        :init
        (setq org-bullets-bullet-list
              '("\u25C9" "\u25CE" "\u26AB" "\u25CB" "\u25BA" "\u25C7"))
       :config
       (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
   #+end_src

   {{{index(inline images)}}}
   {{{binding(C-c C-x C-v, org-­toggle-­inline-­images)}}}

   Org can scale images that are displayed inline (i.e. inside Emacs)
   automatically. This is especially useful for screenshots from a
   high-resolution display, that otherwise tend to become huge. 400
   pixels is good default. Note that inline images can be scaled by
   pressing =+= and =-= when the cursor is on the image.

   #+begin_src emacs-lisp
     (setq org-image-actual-width '(400))
   #+end_src

   The full Org Export user interface consumes a lot of screen space,
   so we disable it. If necessary, it can be activated after =C-c
   C-e= by pressing =?=.

   #+begin_src emacs-lisp
     (setq org-export-dispatch-use-expert-ui t)
   #+end_src

   Here are the global key bindings for Org functions that should be
   available anywhere in Emacs. These are the standard key bindings
   recommended by the Org manual. Org doesn't set them automatically
   though, so it has to be done here.

   {{{binding(C-c l,org-store-link)}}}
   {{{binding(C-c a,org-agenda)}}}
   {{{binding(C-c c,org-capture)}}}

   #+begin_src emacs-lisp
     (global-set-key (kbd "C-c l") 'org-store-link)
     (global-set-key (kbd "C-c a") 'org-agenda)
     (global-set-key (kbd "C-c c") 'org-capture)
   #+end_src

   {{{binding(C-c C-x C-7,org-­toggle-­pretty-­entities)}}}

   The default for pretty symbols is =C-c C-x \=, which is hard to
   type on a german keyboard. So, we'll define an additional binding.

   #+begin_src emacs-lisp
     (define-key org-mode-map (kbd "C-c C-x C-7")
       'org-toggle-pretty-entities)
   #+end_src

