emacs/.emacs.d/emacs.el
  (if (boundp 'mac-auto-operator-composition-mode)
      (mac-auto-operator-composition-mode))
)

(when (window-system)
  (set-frame-font "Fira Code")
  (set-face-attribute 'default nil :height 120)
  (load-theme 'material-frank t))

(when (window-system)
  (tool-bar-mode 0)
  (scroll-bar-mode 0)
  (menu-bar-mode 0)
  (set-frame-parameter nil 'fullscreen 'fullscreen))

(setq initial-scratch-message nil)

(setq org-support-shift-select t)

(setq visible-bell t)
(setq ring-bell-function 'ignore)

(setq visual-line-mode t)

(setq desktop-path '("~/.emacs.d"))
(setq desktop-restore-frames nil)
(desktop-save-mode 1)

;(use-package powerline :straight t)
;(use-package spaceline :straight t)
;(require 'spaceline-config)
;(spaceline-emacs-theme)

(global-set-key (kbd "C-x C-b") 'ibuffer)

(use-package olivetti :straight t)
(use-package hide-mode-line :straight t)

(defun fp/focus-mode ()
  "Enter focused writing mode"
  (interactive)
  (progn
    (if (bound-and-true-p olivetti-mode)
        (progn
          (olivetti-mode 0)
          (hide-mode-line-mode 0))
      (progn
        (olivetti-mode 1)
        (hide-mode-line-mode 1)
        (olivetti-set-width 85)))))
(global-set-key (kbd "s-o") 'fp/focus-mode)

(global-set-key (kbd "C-x s") 'save-buffer)

(use-package ivy :straight t
  :config
  (ivy-mode 1))

(setq org-directory "~/Dropbox/org")

(setq org-default-notes-file (concat org-directory "/todo.org"))
(setq org-default-journal-file (concat org-directory "/journal.org"))

(setq org-agenda-files
      (list
       org-default-journal-file
       org-default-notes-file
       (concat org-directory "/inbox.org")))

(setq org-todo-keywords
      '((sequence "TODO" "|" "DONE" "CANCELLED")))

(setq org-log-done 'time)

(setq
   org-capture-templates
   '(
     ("t" "Todo Item"
      entry (file+headline org-default-notes-file "Tasks")
      "* TODO %?\n  %T\n\n  %a"
      :empty-lines 1)
     ("j" "Journal Entry"
      entry (file+olp+datetree org-default-journal-file)
      "* %:description%?\n  %T\n\n  %a\n  %l\n\n  %i"
      :empty-lines 1)))

(setq fp/snippets-file (concat org-directory "/snippets.org"))
(setq fp/links-file (concat org-directory "/links.org"))
(setq org-refile-targets
      `(((,fp/snippets-file) :maxlevel . 1)
        ((,fp/links-file) :maxlevel . 3)
        (org-agenda-files :maxlevel . 2)))
(setq org-refile-allow-creating-parent-nodes 'confirm)
(setq org-refile-use-outline-path 'file)

(use-package deft
  :straight t
  :bind ("<f9>" . deft)
  :config
  (setq
   deft-extensions '("org" "txt" "rst" "md")
   deft-default-extension "org"
   deft-directory org-directory
   deft-use-filter-string-for-filename t
   ;; The following convienently makes Deft aware
   ;; of #+title lines in Org files
   deft-org-mode-title-prefix t))

(use-package org-bullets
   :straight t
   :init
   (setq org-bullets-bullet-list
         '("\u25C9" "\u25CE" "\u26AB" "\u25CB" "\u25BA" "\u25C7"))
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

(setq org-image-actual-width '(400))

(setq org-export-dispatch-use-expert-ui t)

(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)

(define-key org-mode-map (kbd "C-c C-x C-7")
  'org-toggle-pretty-entities)
