emacs/.emacs.d/emacs.org
** Entities

   The following table defines a couple of custom entities that are
   added to Org's built-in entities. The table data is fed into the
   Lisp block below, interpreted and stored in the variable
   ~org-entities-user~. The columns correspond to the seven fields of
   the variable. Table entries should be inline verbatim, otherwise
   they'd be interpreted by Org. The verbatim markers are stripped
   automatically. HTML expansions that are prefixed by =TeX= are
   automatically embedded in a ~span class="tex"~ element, assuming
   that [[*A CSS style sheet for HTML][the CSS]] has the relevant styles for \TeX logos. For the
   ASCII (A), Latin-1 (L) and UTF-8 (U) columns, =-= is translated to
   the entity name.

   Note that entity completion via ~M-TAB~ doesn't work for custom
   entities. This is most probably a bug in Org.

   #+begin_responsive
   #+tblname: custom-entities
   #+attr_latex:  :font \tiny
   | Entity     | LaTeX               | Math | HTML                                                           | A | L | U |
   |------------+---------------------+------+----------------------------------------------------------------+---+---+---|
   | =TeX=      | =\hologo{TeX}=      | nil  | TeX =T<sub>e</sub>X=                                           | - | - | - |
   | =LaTeX=    | =\hologo{LaTeX}=    | nil  | TeX =L<sup>a</sup>T<sub>e</sub>X=                              | - | - | - |
   | =XeLaTeX=  | =\hologo{XeLaTeX}=  | nil  | TeX =X<sub class ="revcap">e</sub>L<sup>a</sup>T<sub>e</sub>X= | - | - | - |
   | =LuaTeX=   | =\hologo{LuaTeX}=   | nil  | TeX =LuaT<sub>e</sub>X=                                        | - | - | - |
   | =LuaLaTeX= | =\hologo{LuaLaTeX}= | nil  | TeX =LuaL<sup>a</sup>T<sub>e</sub>X=                           | - | - | - |
   | =pdfLaTeX= | =\hologo{pdfLaTeX}= | nil  | TeX =pdfL<sup>a</sup>T<sub>e</sub>X=                           | - | - | - |
   | =BibLaTeX= | =\hologo{BibLaTeX}= | nil  | TeX =BibL<sup>a</sup>T<sub>e</sub>X=                           | - | - | - |
   #+end_responsive


   For the \TeX logos we need ~hologo~ in the \LaTeX export. {{{package(hologo)}}}

   #+begin_src emacs-lisp
     (add-to-list 'org-latex-packages-alist '("" "hologo"))
   #+end_src

   The following code interprets a table entry according to the
   description above and adds the result to ~org-entities-user~.

   {{{tag(«entities-process-entity»)}}}
   #+name: entities-process-entity
   #+begin_src emacs-lisp :tangle no
     (cl-flet
         ((unverb (text) (string-trim text "=" "="))
          (fallback-if-dash (text fallback)
            (if (string= "-" text) fallback text)))
       (let ((entity-string (unverb (nth 0 entity)))
             (entity-latex (unverb (nth 1 entity)))
             (entity-math (unverb (nth 2 entity)))
             (entity-html (unverb (nth 3 entity)))
             (entity-ascii (unverb (nth 4 entity)))
             (entity-latin1 (unverb (nth 5 entity)))
             (entity-utf8 (unverb (nth 6 entity))))
         (add-to-list
          'org-entities-user
          (list entity-string
                entity-latex
                (if (string= "t" entity-math) t nil)
                (if (string-prefix-p "TeX" entity-html)
                    (format "<span class=\"tex\">%s</span>"
                            (unverb (substring entity-html 4)))
                  (unverb entity-latex))
                (fallback-if-dash entity-ascii entity-string)
                (fallback-if-dash entity-latin1 entity-string)
                (fallback-if-dash entity-utf8 entity-string)))))
   #+end_src

   The loop goes over the table data that is fed into the Lisp
   code as a variable named ~custom-entities~.

   #+begin_src emacs-lisp :var custom-entities=custom-entities
     (cl-loop for entity in custom-entities
              do
              <<entities-process-entity>>
              )
   #+end_src


** Macros

   {{{index(macros)}}}

   Org Mode has /macros/ which are expanded before export. Macros can
   be defined inside an Org file using the ~#+macro~ syntax:

   : #+macro: macro-name macro-body

   Macro invocations are demarcated with triple braces,
   e.g. ={{{macro-name}}}=. I prefer to hide the triple braces around
   Org macros, though.

   #+begin_src emacs-lisp
     (setq org-hide-macro-markers t)
   #+end_src

   Global macros can be defined by adding their definitions to an
   Emacs Lisp variable. Macros defined globally are available to all
   Org documents. While this is convenient, it has the disadvantage of
   effectively creating an Org dialect, as documents using those
   macros are incompatible with Emacs environments that do not define
   them. The use of global macros should therefore be restricted to
   personal files, which I promise to do ...

   #+begin_src emacs-lisp
     (setq org-export-global-macros
           `(
             <<org-macros>>
             ))
   #+end_src

   The ~index(term)~ macro creates an index entry when exporting to
   \LaTeX. While there are /two/ other ways of creating index entries,
   namely the =index:term= links that come with ~org-ref~, and Org's
   built-in =#+index=, I prefer my custom solution as it allows
   arbitrary \LaTeX code in its argument -- e.g. enabling formatted
   index entries -- and avoids dysfunctional links in the HTML output.

   {{{tag(«org-macros»)}}}
   #+begin_src emacs-lisp :tangle no :noweb-ref org-macros
     ("index"
      . ,(concat
          "(eval (format \""
          "@@latex: "
          "\\\\index{%1$s}"
          "@@\\n"
          "{{{if-export(html,#+index: %1$s)}}}\\n"
          "\""
          " $1))"))
   #+end_src

   The ~package(name)~ macro creates /two/ index entries for a program
   package, one under the package name, and another one nested under
   the "package" entry. For this document, package means an Emacs Lisp
   package, but the macro can obviously be used for packages of other
   programming languages as well.

   {{{tag(«org-macros»)}}}
   #+begin_src emacs-lisp :tangle no :noweb-ref org-macros
     ("package"
      . ,(concat
          "{{{index($1@\\texttt{$1} (package))}}}"
          "{{{index(package!$1@\\texttt{$1})}}}"))
   #+end_src

   More specific to Emacs is the ~binding(name,function)~ macro that
   adds an index entry for a key binding, also specifying the
   associated Emacs Lisp function.

   {{{tag(«org-macros»)}}}
   #+begin_src emacs-lisp :tangle no :noweb-ref org-macros
     ("binding"
      . ,(concat
          "{{{index(key binding!$1@\\texttt{$1}\\, "
          "\\texttt{$2})}}}"))
   #+end_src

   The macro ~tag(text)~ adds a little adornment to source blocks.

   {{{tag(«org-macros»)}}}
   #+begin_src emacs-lisp :tangle no :noweb-ref org-macros
     ("tag"
      . ,(concat
          "(eval (format \""
          "@@latex: "
          "{\\\\vspace{0.3cm}\\\\hfill"
          "\\\\footnotesize\\\\texttt{%1$s}$\\\\equiv$}"
          "\\\\vspace{-0.3cm}"
          "@@\n"
          "{{{if-export(html,#+caption: %1$s)}}}\n"
          "#+attr_latex: :options bgcolor=sourcebg"
          "\""
          " $1))"))
   #+end_src

   Org Mode has a couple of ways to send /raw/ text to exporter
   backends, but there is no way (I know of, that is) to have
   conditional Org fragments that are specific for a particular
   exporter backend. The ~if-export(backend,orgtext)~ macro does just
   that: when exporting to ~backend~, the text ~orgtext~ will be
   inserted into the Org document in place of the macro.

   {{{tag(«org-macros»)}}}
   #+begin_src emacs-lisp :tangle no :noweb-ref org-macros
     ("if-export"
      . ,(concat
          "(eval (if (org-export-derived-backend-p "
          "org-export-current-backend (intern $1)) $2))"))
   #+end_src

** Export

   We want to export "smart quotes" with all backends
   automatically.

   #+begin_src emacs-lisp
     (setq org-export-with-smart-quotes t)
   #+end_src

   This can be switched off for a document by using the
   quote option like so:

   : #+options: ':nil

   All exports go to a subdirectory, to not clutter the directory with the org files.

   #+begin_src emacs-lisp
     (defvar org-export-output-directory-prefix
       "export_" "prefix of directory used for org-mode export")

     (defadvice org-export-output-file-name (before org-add-export-dir activate)
       "Modifies org-export to place exported files in a different directory"
       (when (not pub-dir)
         (setq pub-dir (concat org-export-output-directory-prefix (substring extension 1)))
         (when (not (file-directory-p pub-dir))
           (make-directory pub-dir))))
   #+end_src

*** Pandoc

    Provide additional export formats via [[https://pandoc.org/][pandoc]].

    #+begin_src emacs-lisp
      (use-package ox-pandoc :straight t)
    #+end_src


