emacs/.emacs.d/emacs.el

(add-to-list 'org-latex-packages-alist '("" "hologo"))

(let ((custom-entities '(("=TeX=" "=\\hologo{TeX}=" "nil" "TeX =T<sub>e</sub>X=" "-" "-" "-") ("=LaTeX=" "=\\hologo{LaTeX}=" "nil" "TeX =L<sup>a</sup>T<sub>e</sub>X=" "-" "-" "-") ("=XeLaTeX=" "=\\hologo{XeLaTeX}=" "nil" "TeX =X<sub class =\"revcap\">e</sub>L<sup>a</sup>T<sub>e</sub>X=" "-" "-" "-") ("=LuaTeX=" "=\\hologo{LuaTeX}=" "nil" "TeX =LuaT<sub>e</sub>X=" "-" "-" "-") ("=LuaLaTeX=" "=\\hologo{LuaLaTeX}=" "nil" "TeX =LuaL<sup>a</sup>T<sub>e</sub>X=" "-" "-" "-") ("=pdfLaTeX=" "=\\hologo{pdfLaTeX}=" "nil" "TeX =pdfL<sup>a</sup>T<sub>e</sub>X=" "-" "-" "-") ("=BibLaTeX=" "=\\hologo{BibLaTeX}=" "nil" "TeX =BibL<sup>a</sup>T<sub>e</sub>X=" "-" "-" "-"))))
(cl-loop for entity in custom-entities
         do
         (cl-flet
             ((unverb (text) (string-trim text "=" "="))
              (fallback-if-dash (text fallback)
                (if (string= "-" text) fallback text)))
           (let ((entity-string (unverb (nth 0 entity)))
                 (entity-latex (unverb (nth 1 entity)))
                 (entity-math (unverb (nth 2 entity)))
                 (entity-html (unverb (nth 3 entity)))
                 (entity-ascii (unverb (nth 4 entity)))
                 (entity-latin1 (unverb (nth 5 entity)))
                 (entity-utf8 (unverb (nth 6 entity))))
             (add-to-list
              'org-entities-user
              (list entity-string
                    entity-latex
                    (if (string= "t" entity-math) t nil)
                    (if (string-prefix-p "TeX" entity-html)
                        (format "<span class=\"tex\">%s</span>"
                                (unverb (substring entity-html 4)))
                      (unverb entity-latex))
                    (fallback-if-dash entity-ascii entity-string)
                    (fallback-if-dash entity-latin1 entity-string)
                    (fallback-if-dash entity-utf8 entity-string)))))
         )
)

(setq org-hide-macro-markers t)

(setq org-export-global-macros
      `(
        ("index"
         . ,(concat
             "(eval (format \""
             "@@latex: "
             "\\\\index{%1$s}"
             "@@\\n"
             "{{{if-export(html,#+index: %1$s)}}}\\n"
             "\""
             " $1))"))
        ("package"
         . ,(concat
             "{{{index($1@\\texttt{$1} (package))}}}"
             "{{{index(package!$1@\\texttt{$1})}}}"))
        ("binding"
         . ,(concat
             "{{{index(key binding!$1@\\texttt{$1}\\, "
             "\\texttt{$2})}}}"))
        ("tag"
         . ,(concat
             "(eval (format \""
             "@@latex: "
             "{\\\\vspace{0.3cm}\\\\hfill"
             "\\\\footnotesize\\\\texttt{%1$s}$\\\\equiv$}"
             "\\\\vspace{-0.3cm}"
             "@@\n"
             "{{{if-export(html,#+caption: %1$s)}}}\n"
             "#+attr_latex: :options bgcolor=sourcebg"
             "\""
             " $1))"))
        ("if-export"
         . ,(concat
             "(eval (if (org-export-derived-backend-p "
             "org-export-current-backend (intern $1)) $2))"))
        ))

(setq org-export-with-smart-quotes t)

(defvar org-export-output-directory-prefix
  "export_" "prefix of directory used for org-mode export")

(defadvice org-export-output-file-name (before org-add-export-dir activate)
  "Modifies org-export to place exported files in a different directory"
  (when (not pub-dir)
    (setq pub-dir (concat org-export-output-directory-prefix (substring extension 1)))
    (when (not (file-directory-p pub-dir))
      (make-directory pub-dir))))

(use-package tex
