emacs/.emacs.d/emacs.org
*** \LaTeX export

    The following enables ~cdlatex~ abbreviations in Org documents.

    {{{package(auctex)}}}
    {{{package(cdlatex)}}}
    #+begin_src emacs-lisp
      (use-package tex
        :straight auctex)
      (use-package cdlatex
        :straight t)
      (add-hook 'org-mode-hook 'turn-on-org-cdlatex)
    #+end_src

    Org's \LaTeX export is implemented in ~ox-latex~. We also need
    ~ox-bibtex~.


    {{{package(org)}}}
    {{{package(ox-latex)}}}
    #+begin_src emacs-lisp
      (require 'org)
      (require 'ox-latex)
    #+end_src

    {{{index(UTF-8)}}}
    {{{index(XeLaTeX@\hologo{XeLaTeX})}}}

    I always use \XeLaTeX for its capability of using system fonts
    and reading UTF-8 inputs directly[fn::as of 2020, standard
    \pdfLaTeX can read UTF-8 also].

     #+begin_src emacs-lisp
       (setq org-latex-compiler "xelatex")
     #+end_src

    {{{package(babel)}}}

    While ~polyglossia~ used to be required for \XeLaTeX and \LuaLaTeX,
    this is no longer the case: ~babel~ handles all \LaTeX variants
    well. ~babel~ is also required for smart quotes, as it defines
    \LaTeX macros that Org uses for quotes in a number of languages
    (e.g. German).

     #+begin_src emacs-lisp
       (add-to-list 'org-latex-packages-alist
                    '("AUTO" "babel" t))
     #+end_src

    Org defaults to ~"germanb"~ for language ~"de"~, but we want
    ~"ngerman"~.

     #+begin_src emacs-lisp
       (setcdr (assoc "de" org-latex-babel-language-alist) "ngerman")
     #+end_src

    To run \LaTeX I use ~latexmk~, which automates running the \LaTeX
    programs for type-setting, index and bibliography creation etc. as
    often as required.

     #+begin_src emacs-lisp
       (setq org-latex-pdf-process
             '("cd %o && latexmk -shell-escape -pdfxe -8bit %b"))
     #+end_src

    Because we use \XeLaTeX by default, we also have to fix the
    settings for \LaTeX previews, as Org's built-in preview doesn't
    expect that and gets the \LaTeX headers for the generated \TeX
    file wrong. We therefore define the ~dvisvgm~ preview process from
    scratch and make it the default:

    #+begin_src emacs-lisp
      (setq org-preview-latex-default-process 'dvisvgm)
      (add-to-list
       'org-preview-latex-process-alist
       '(dvisvgm :programs
                 ("latex" "dvisvgm")
                 :description "dvi > svg"
                 :message "you need to install the programs: latex and dvisvgm."
                 :use-xcolor t
                 :image-input-type "xdv"
                 :image-output-type "svg"
                 :image-size-adjust (1.7 . 1.5)
                 :latex-compiler
                 ("xelatex -no-pdf -interaction nonstopmode -output-directory %o %f")
                 :image-converter
                 ("dvisvgm %f -n -b min -c %S -o %O")))
    #+end_src

    I use a custom document class ~fpbarticle~ as the default for \LaTeX
    export from Org. That class defines my personal layout and adds the
    packages I prefer.

    #+name: latex-preamble-template
    #+begin_src emacs-lisp :tangle no
      "\\documentclass[11pt,a4paper]{fpbarticle}
      [DEFAULT-PACKAGES]
      [PACKAGES]
      [EXTRA]
      \\graphicspath{{../}}
      "
    #+end_src

    #+begin_src emacs-lisp
      (add-to-list
       'org-latex-classes
       '("fpbarticle"
         <<latex-preamble-template>>
         ("\\section{%s}" . "\\section*{%s}")
         ("\\subsection{%s}" . "\\subsection*{%s}")
         ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
         ("\\paragraph{%s}" . "\\paragraph*{%s}")
         ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
      (setq org-latex-default-class "fpbarticle")
    #+end_src


    #+begin_src emacs-lisp
      (setq org-latex-listings 'minted)
      (add-to-list 'org-latex-minted-langs '(org "md"))
      (setq org-latex-minted-options
            '(("breaklines" "true") ("breakafter" "/") ("bgcolor" "sourcebg")))
    #+end_src

    {{{package(ox-extra)}}}
    #+begin_src emacs-lisp
      (use-package ob-mermaid :straight t)
      (org-babel-do-load-languages
       'org-babel-load-languages
       '(
         (latex . t)
         (mermaid .t)
         (plantuml . t)))
      (let
          ((mmdc-binary (locate-file "mmdc" exec-path exec-suffixes 1)))
        (if mmdc-binary
            (setq ob-mermaid-cli-path mmdc-binary)
          (message "Mermaid CLI mmdc not found")))
      (setq org-plantuml-exec-mode 'plantuml)
      (use-package plantuml-mode :straight t)
      (setq plantuml-default-exec-mode 'executable)
      (setq plantuml-indent-level 2)
      ;;(require 'ox-extra)
      ;;(ox-extras-activate '(ignore-headlines))
    #+end_src

*** HTML

    We export HTML5 by default. For source blocks, we just export CSS
    selectors and set the style ourselves.

    #+begin_src emacs-lisp
      (setq org-html-doctype "html5")
    #+end_src

