emacs/.emacs.d/emacs.el
  :straight auctex)
(use-package cdlatex
  :straight t)
(add-hook 'org-mode-hook 'turn-on-org-cdlatex)

(require 'org)
(require 'ox-latex)

(setq org-latex-compiler "xelatex")

(add-to-list 'org-latex-packages-alist
             '("AUTO" "babel" t))

(setcdr (assoc "de" org-latex-babel-language-alist) "ngerman")

(setq org-latex-pdf-process
      '("cd %o && latexmk -shell-escape -pdfxe -8bit %b"))

(setq org-preview-latex-default-process 'dvisvgm)
(add-to-list
 'org-preview-latex-process-alist
 '(dvisvgm :programs
           ("latex" "dvisvgm")
           :description "dvi > svg"
           :message "you need to install the programs: latex and dvisvgm."
           :use-xcolor t
           :image-input-type "xdv"
           :image-output-type "svg"
           :image-size-adjust (1.7 . 1.5)
           :latex-compiler
           ("xelatex -no-pdf -interaction nonstopmode -output-directory %o %f")
           :image-converter
           ("dvisvgm %f -n -b min -c %S -o %O")))

(add-to-list
 'org-latex-classes
 '("fpbarticle"
   "\\documentclass[11pt,a4paper]{fpbarticle}
   [DEFAULT-PACKAGES]
   [PACKAGES]
   [EXTRA]
   \\graphicspath{{../}}
   "
   ("\\section{%s}" . "\\section*{%s}")
   ("\\subsection{%s}" . "\\subsection*{%s}")
   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
   ("\\paragraph{%s}" . "\\paragraph*{%s}")
   ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
(setq org-latex-default-class "fpbarticle")

(setq org-latex-listings 'minted)
(add-to-list 'org-latex-minted-langs '(org "md"))
(setq org-latex-minted-options
      '(("breaklines" "true") ("breakafter" "/") ("bgcolor" "sourcebg")))

(use-package ob-mermaid :straight t)
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (latex . t)
   (mermaid .t)
   (plantuml . t)))
(let
    ((mmdc-binary (locate-file "mmdc" exec-path exec-suffixes 1)))
  (if mmdc-binary
      (setq ob-mermaid-cli-path mmdc-binary)
    (message "Mermaid CLI mmdc not found")))
(setq org-plantuml-exec-mode 'plantuml)
(use-package plantuml-mode :straight t)
(setq plantuml-default-exec-mode 'executable)
(setq plantuml-indent-level 2)
;;(require 'ox-extra)
;;(ox-extras-activate '(ignore-headlines))

(setq org-html-doctype "html5")
