emacs/.emacs.d/emacs.org
*** A CSS style sheet for HTML

    This is my attempt to create a custom, responsive CSS style sheet
    for Org HTML exports on top of the standard CSS generated by
    Org. Be warned: my CSS fu is seriously limited.

    We put the style into ~org-html-head~, so it gets embedded into
    exported HTML. The CSS code is defined in the following sections,
    and goes into the noweb reference =<<org-css>>= that is expanded
    in Lisp fragment below. To not confuse Lisp, it is important that
    there must be no double quotes in the CSS.

    #+begin_src emacs-lisp
      (setq org-html-head "
      <style type=\"text/css\">
        <!--/*--><![CDATA[/*><!--*/
          <<org-css>>
          <<org-css-responsive-toc>>
        /*]]>*/-->
      </style>
      ")
      (setq org-html-head-no-toc "
      <style type=\"text/css\">
        <!--/*--><![CDATA[/*><!--*/
          <<org-css>>
          <<org-css-no-toc>>
        /*]]>*/-->
      </style>
      ")
    #+end_src

    Here comes a little hack to modify the style sheet in case the
    table of contents is disabled (via the =toc:nil= option) for a
    particular document. We install a filter into the Org export
    machinery, that replaces the custom CSS from ~org-html-head~ with
    the variant ~org-html-head-no-toc~ (but only if the current
    =:html-head= is the same as ~org-html-head~).

    #+begin_src emacs-lisp
      (defun fp/html-filter (text backend info)
        (when (org-export-derived-backend-p backend 'html)
          (if (and
               (not (plist-get info :with-toc))
               (string= (plist-get info :html-head) org-html-head))
              (plist-put info :html-head org-html-head-no-toc)))
        text)
      (add-to-list 'org-export-filter-parse-tree-functions 'fp/html-filter)
    #+end_src

    Font imports have to come very early in the style sheet, otherwise
    some browsers don't load the font. We import Fira Code for source
    code etc., and a CSS fragment from my S3 bucket for web resources
    that brings a converted \TeX font for drop caps.

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      @import url('https://fonts.googleapis.com/css2?family=Fira+Code&display=swap');
      @import url('https://fpb-web-resources.s3.eu-central-1.amazonaws.com/tcaps.css');
    #+end_src

    The main fonts are /Times New Roman/ for copy and /Fira Code/ for
    source code. For inline code fragments, Fira's font size is
    reduced to approximate the x-height of Times. This is not perfect
    though, as different browsers seem to have different Times
    variants.

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
        body {
            font-family: 'Times New Roman';
            font-size: 16pt;
            background-color: #f8f8f8;
            hyphens: auto;
        }
        pre, code {
            font-family: 'Fira Code';
        }
    #+end_src

    We also enable in-word breaks for inline code to avoid overflows
    or ragged paragraphs. Lamentably, =overflow-wrap= is not supported
    by Safari, so we add =word-wrap= as a fallback, although that
    doesn't work as well.

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      code {
          word-wrap: break-word;
          overflow-wrap: anywhere;
          font-size: 85%;
      }
    #+end_src

    Same for links, plus undecorate them.

    {{{tag(«org-src»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      a {
          text-decoration: none;
          word-wrap: break-word;
          overflow-wrap: anywhere;
      }
    #+end_src

    Here come the headers.

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      h1, h2, h3, h4 {
          font-weight: bold;
          color: #322d26;
      }
      h2 {
          padding-top: 2em;
          margin-top: 0;
      }
      .subtitle {
          font-size: 12pt;
          font-weight: normal;
      }
      #preamble p {
          font-size: 12pt;
      }
    #+end_src

    Source blocks have a lighter background and a smaller font
    size. We also fix the weird appearance of Org's standard
    =.src::before= tags that appear on hover.

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      pre {
          font-size: 70%;
      }
      pre.src {
          background-color: #fff;
          border:0;
          box-shadow: none;
          border-top: 1px solid #ccc;
          border-bottom: 1px solid #ccc;
          margin: 0;
          padding: 8pt;
      }
      pre.src::before {
          font-size: 80%;
          font-style: italic;
          border: 0;
          bottom: 0;
          background-color: inherit;
      }
    #+end_src

    "Annotated" source blocks get a caption from the ~tag~ macro (in
    the HTML case). We tweak the caption's appearance, and those
    blocks also get a different background.

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      span.listing-number {
          display: none;
      }
      label.org-src-name {
          font-size: smaller;
          font-style: italic;
      }
      label.org-src-name + pre.src {
          background-color: #f8f8f7;
          box-shadow: 3px 3px 3px #eee;
          border: 1px solid #ccc;
      }
    #+end_src

    We make Org export source code with CSS classes attached and
    define some simple styles ourselves.

    #+begin_src emacs-lisp
      (setq org-html-htmlize-output-type 'css)
    #+end_src

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      .org-comment, .org-comment-delimiter, .org-doc {
          color: #9c6645;
          font-style: italic;
      }
      .org-string {
          color: #477c9c;
      }
    #+end_src

    Here comes some fashionable typography.

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      .section-number-1, .section-number-2, .section-number-3,
      .section-number-4, .section-number-5 {
          color: #aaaaaa;
      }
      .dropcap p::first-letter {
          color: #A52A2A;
          float: left;
          font-size: 1.9em;
          margin: 0 .1em 0 0;
          line-height: 1.2;
          font-family: 'Typographer Caps';
      }
    #+end_src

    Some simple formatting for tables.

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      table {
          font-size: 80%;
          border-top: 2px solid #888;
          border-bottom: 2px solid #888;
      }
      thead {
          border-bottom: 1px solid #888;
      }
      th {
          padding-right: 1em;
      }
      td {
          padding-top: 6pt;
          padding-right: 1em;
      }
    #+end_src

    The HTML bibliography is created by =bibtex2html=, which simply
    produces a table that needs some styling.

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      #bibliography table {
          background-color: #faf8f5;
      }
      #bibliography h2 {
          display: none;
      }
      td > blockquote {
          font-style: italic;
          margin-top: 4pt;
          margin-left: 0;
      }
      td.bibtexnumber {
          white-space: nowrap;
          text-align: left;
      }
      .responsive {
          overflow-x: auto;
      }
    #+end_src

    Add brackets around citations.

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      .org-ref-reference::before {
          content: '[';
      }
      .org-ref-reference::after {
          content: ']';
      }
    #+end_src

    Here starts the "responsive" part: the default is to hide the
    table of contents and the postamble, and to add a little margin
    around all of the body. This looks pretty okay on smaller
    displays.

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      div#table-of-contents {
          display: none;
      }
      div#table-of-contents h2 {
          display: none;
      }
      #postamble {
          display: none;
      }
    #+end_src

    ... unless there is enough space to display the table of contents
    and the title in a sidebar on the left.

    {{{tag(«org-css-reponsive-toc»)}}}
    #+begin_src css :tangle no :noweb-ref org-css-responsive-toc
      @media only screen and (max-width: 799px) {
          body {
              margin: 5%;
          }
      }
      @media only screen and (min-width: 800px) {
          #content {
              margin-left: 200px;
              padding-left: 4em;
              display: block;
              overflow: auto;
              max-width: 48em;
          }
          div#table-of-contents {
              position: fixed;
              top: 75px;
              left: 0;
              bottom: 0;
              width: 200px;
              padding: 0em 1em 1em 1em;
              font-size: 75%;
              overflow-y: scroll;
              display: block;
          }
          #postamble {
              display: inline-block;
              margin-left: 200px;
              padding-left: 4em;
          }
          .title {
              text-align: left;
              position: fixed;
              font-size: 12pt;
              top: 0;
              left: 0;
              width: 200px;
              margin: 0;
              padding: 1em;
              border-bottom: 2px solid #a52a2a;
          }
      }
    #+end_src

    This is the variant when no ToC is selected.

    {{{tag(«org-css-no-toc»)}}}
    #+begin_src css :tangle no :noweb-ref org-css-no-toc
      body {
          margin: 5%;
      }
      #content {
          display: block;
          overflow: auto;
          max-width: 48em;
      }
    #+end_src

    Style the table of contents by un-prefixing list items, reducing
    the font size and adding a little space above each top-level
    section.

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      #text-table-of-contents ul {
          list-style-type: none;
          padding-inline-start: 1em;
          margin-block-start: 0;
      }
      #text-table-of-contents a {
          color: black;
      }
      #text-table-of-contents > ul > li {
          padding-top: .5em;
      }
    #+end_src

    Some special CSS to typeset \TeX logos, which are defined in [[*Entities][Entities]].

    {{{tag(«org-css»)}}}
    #+begin_src css :tangle no :noweb-ref org-css
      .tex {
          font-size: 1em;
      }
      .tex sub {
          text-transform: uppercase;
          font-size: 0.95em;
          vertical-align: -0.5ex;
          margin-left: -0.1667em;
          margin-right: -0.125em;
      }
      .tex sup {
          text-transform: uppercase;
          font-size: 0.75em;
          vertical-align: 0.25em;
          margin-left: -0.36em;
          margin-right: -0.15em;
      }
      .revcap {
          display: inline-block;
          text-transform: uppercase;
          -webkit-transform: rotateY(180deg);
          -moz-transform: rotateY(180deg);
          -ms-transform: rotateY(180deg);
          transform: rotateY(180deg);
      }
   #+end_src


