emacs/.emacs.d/emacs.el

(setq org-html-head "
<style type=\"text/css\">
  <!--/*--><![CDATA[/*><!--*/
    @import url('https://fonts.googleapis.com/css2?family=Fira+Code&display=swap');
    @import url('https://fpb-web-resources.s3.eu-central-1.amazonaws.com/tcaps.css');
    body {
        font-family: 'Times New Roman';
        font-size: 16pt;
        background-color: #f8f8f8;
        hyphens: auto;
    }
    pre, code {
        font-family: 'Fira Code';
    }
    code {
        word-wrap: break-word;
        overflow-wrap: anywhere;
        font-size: 85%;
    }
    a {
        text-decoration: none;
        word-wrap: break-word;
        overflow-wrap: anywhere;
    }
    h1, h2, h3, h4 {
        font-weight: bold;
        color: #322d26;
    }
    h2 {
        padding-top: 2em;
        margin-top: 0;
    }
    .subtitle {
        font-size: 12pt;
        font-weight: normal;
    }
    #preamble p {
        font-size: 12pt;
    }
    pre {
        font-size: 70%;
    }
    pre.src {
        background-color: #fff;
        border:0;
        box-shadow: none;
        border-top: 1px solid #ccc;
        border-bottom: 1px solid #ccc;
        margin: 0;
        padding: 8pt;
    }
    pre.src::before {
        font-size: 80%;
        font-style: italic;
        border: 0;
        bottom: 0;
        background-color: inherit;
    }
    span.listing-number {
        display: none;
    }
    label.org-src-name {
        font-size: smaller;
        font-style: italic;
    }
    label.org-src-name + pre.src {
        background-color: #f8f8f7;
        box-shadow: 3px 3px 3px #eee;
        border: 1px solid #ccc;
    }
    .org-comment, .org-comment-delimiter, .org-doc {
        color: #9c6645;
        font-style: italic;
    }
    .org-string {
        color: #477c9c;
    }
    .section-number-1, .section-number-2, .section-number-3,
    .section-number-4, .section-number-5 {
        color: #aaaaaa;
    }
    .dropcap p::first-letter {
        color: #A52A2A;
        float: left;
        font-size: 1.9em;
        margin: 0 .1em 0 0;
        line-height: 1.2;
        font-family: 'Typographer Caps';
    }
    table {
        font-size: 80%;
        border-top: 2px solid #888;
        border-bottom: 2px solid #888;
    }
    thead {
        border-bottom: 1px solid #888;
    }
    th {
        padding-right: 1em;
    }
    td {
        padding-top: 6pt;
        padding-right: 1em;
    }
    #bibliography table {
        background-color: #faf8f5;
    }
    #bibliography h2 {
        display: none;
    }
    td > blockquote {
        font-style: italic;
        margin-top: 4pt;
        margin-left: 0;
    }
    td.bibtexnumber {
        white-space: nowrap;
        text-align: left;
    }
    .responsive {
        overflow-x: auto;
    }
    .org-ref-reference::before {
        content: '[';
    }
    .org-ref-reference::after {
        content: ']';
    }
    div#table-of-contents {
        display: none;
    }
    div#table-of-contents h2 {
        display: none;
    }
    #postamble {
        display: none;
    }
    #text-table-of-contents ul {
        list-style-type: none;
        padding-inline-start: 1em;
        margin-block-start: 0;
    }
    #text-table-of-contents a {
        color: black;
    }
    #text-table-of-contents > ul > li {
        padding-top: .5em;
    }
    .tex {
        font-size: 1em;
    }
    .tex sub {
        text-transform: uppercase;
        font-size: 0.95em;
        vertical-align: -0.5ex;
        margin-left: -0.1667em;
        margin-right: -0.125em;
    }
    .tex sup {
        text-transform: uppercase;
        font-size: 0.75em;
        vertical-align: 0.25em;
        margin-left: -0.36em;
        margin-right: -0.15em;
    }
    .revcap {
        display: inline-block;
        text-transform: uppercase;
        -webkit-transform: rotateY(180deg);
        -moz-transform: rotateY(180deg);
        -ms-transform: rotateY(180deg);
        transform: rotateY(180deg);
    }
    @media only screen and (max-width: 799px) {
        body {
            margin: 5%;
        }
    }
    @media only screen and (min-width: 800px) {
        #content {
            margin-left: 200px;
            padding-left: 4em;
            display: block;
            overflow: auto;
            max-width: 48em;
        }
        div#table-of-contents {
            position: fixed;
            top: 75px;
            left: 0;
            bottom: 0;
            width: 200px;
            padding: 0em 1em 1em 1em;
            font-size: 75%;
            overflow-y: scroll;
            display: block;
        }
        #postamble {
            display: inline-block;
            margin-left: 200px;
            padding-left: 4em;
        }
        .title {
            text-align: left;
            position: fixed;
            font-size: 12pt;
            top: 0;
            left: 0;
            width: 200px;
            margin: 0;
            padding: 1em;
            border-bottom: 2px solid #a52a2a;
        }
    }
  /*]]>*/-->
</style>
")
(setq org-html-head-no-toc "
<style type=\"text/css\">
  <!--/*--><![CDATA[/*><!--*/
    @import url('https://fonts.googleapis.com/css2?family=Fira+Code&display=swap');
    @import url('https://fpb-web-resources.s3.eu-central-1.amazonaws.com/tcaps.css');
    body {
        font-family: 'Times New Roman';
        font-size: 16pt;
        background-color: #f8f8f8;
        hyphens: auto;
    }
    pre, code {
        font-family: 'Fira Code';
    }
    code {
        word-wrap: break-word;
        overflow-wrap: anywhere;
        font-size: 85%;
    }
    a {
        text-decoration: none;
        word-wrap: break-word;
        overflow-wrap: anywhere;
    }
    h1, h2, h3, h4 {
        font-weight: bold;
        color: #322d26;
    }
    h2 {
        padding-top: 2em;
        margin-top: 0;
    }
    .subtitle {
        font-size: 12pt;
        font-weight: normal;
    }
    #preamble p {
        font-size: 12pt;
    }
    pre {
        font-size: 70%;
    }
    pre.src {
        background-color: #fff;
        border:0;
        box-shadow: none;
        border-top: 1px solid #ccc;
        border-bottom: 1px solid #ccc;
        margin: 0;
        padding: 8pt;
    }
    pre.src::before {
        font-size: 80%;
        font-style: italic;
        border: 0;
        bottom: 0;
        background-color: inherit;
    }
    span.listing-number {
        display: none;
    }
    label.org-src-name {
        font-size: smaller;
        font-style: italic;
    }
    label.org-src-name + pre.src {
        background-color: #f8f8f7;
        box-shadow: 3px 3px 3px #eee;
        border: 1px solid #ccc;
    }
    .org-comment, .org-comment-delimiter, .org-doc {
        color: #9c6645;
        font-style: italic;
    }
    .org-string {
        color: #477c9c;
    }
    .section-number-1, .section-number-2, .section-number-3,
    .section-number-4, .section-number-5 {
        color: #aaaaaa;
    }
    .dropcap p::first-letter {
        color: #A52A2A;
        float: left;
        font-size: 1.9em;
        margin: 0 .1em 0 0;
        line-height: 1.2;
        font-family: 'Typographer Caps';
    }
    table {
        font-size: 80%;
        border-top: 2px solid #888;
        border-bottom: 2px solid #888;
    }
    thead {
        border-bottom: 1px solid #888;
    }
    th {
        padding-right: 1em;
    }
    td {
        padding-top: 6pt;
        padding-right: 1em;
    }
    #bibliography table {
        background-color: #faf8f5;
    }
    #bibliography h2 {
        display: none;
    }
    td > blockquote {
        font-style: italic;
        margin-top: 4pt;
        margin-left: 0;
    }
    td.bibtexnumber {
        white-space: nowrap;
        text-align: left;
    }
    .responsive {
        overflow-x: auto;
    }
    .org-ref-reference::before {
        content: '[';
    }
    .org-ref-reference::after {
        content: ']';
    }
    div#table-of-contents {
        display: none;
    }
    div#table-of-contents h2 {
        display: none;
    }
    #postamble {
        display: none;
    }
    #text-table-of-contents ul {
        list-style-type: none;
        padding-inline-start: 1em;
        margin-block-start: 0;
    }
    #text-table-of-contents a {
        color: black;
    }
    #text-table-of-contents > ul > li {
        padding-top: .5em;
    }
    .tex {
        font-size: 1em;
    }
    .tex sub {
        text-transform: uppercase;
        font-size: 0.95em;
        vertical-align: -0.5ex;
        margin-left: -0.1667em;
        margin-right: -0.125em;
    }
    .tex sup {
        text-transform: uppercase;
        font-size: 0.75em;
        vertical-align: 0.25em;
        margin-left: -0.36em;
        margin-right: -0.15em;
    }
    .revcap {
        display: inline-block;
        text-transform: uppercase;
        -webkit-transform: rotateY(180deg);
        -moz-transform: rotateY(180deg);
        -ms-transform: rotateY(180deg);
        transform: rotateY(180deg);
    }
    body {
        margin: 5%;
    }
    #content {
        display: block;
        overflow: auto;
        max-width: 48em;
    }
  /*]]>*/-->
</style>
")

(defun fp/html-filter (text backend info)
  (when (org-export-derived-backend-p backend 'html)
    (if (and
         (not (plist-get info :with-toc))
         (string= (plist-get info :html-head) org-html-head))
        (plist-put info :html-head org-html-head-no-toc)))
  text)
(add-to-list 'org-export-filter-parse-tree-functions 'fp/html-filter)

(setq org-html-htmlize-output-type 'css)

(require 'bibtex)
