emacs/.emacs.d/emacs.org
** Org Ref

   {{{package(org-ref)}}}
   {{{package(bibtex)}}}
   {{{package(ox-bibtex)}}}

   Set up John Kitchin's ~org-ref~ (FIXME: documentation needs to be
   completed). It is important to require ~ox-bibtex~ /before/
   ~org-ref~, because both try to define the =cite:= link type, and we
   want the =:follow= function from ~org-ref~.

   #+begin_src emacs-lisp
     (require 'bibtex)
     ;;(require 'ox-bibtex)
     ;; Remove the "cite" entry added by ox-bibtex, otherwise we'll get a
     ;; warning that it is redefined by org-ref
     (setq org-link-parameters
           (assoc-delete-all "cite" org-link-parameters))
     (bibtex-set-dialect 'biblatex)
     (add-to-list
      'bibtex-biblatex-entry-alist
      '("software" "Software"
        (("title") ("author") ("date") ("url") ("abstract"))
        nil
        "keywords"))
     (setq
      my-bibliography-dir (file-name-as-directory "~/References")
      my-bib-file (concat my-bibliography-dir "cslab.bib"))

     (use-package org-ref
       :straight t
       :config
       (setq
        reftex-default-bibliography (list my-bib-file)
        org-ref-default-bibliography (list my-bib-file)
        bibtex-completion-bibliography (list my-bib-file)
        org-ref-bibliography-notes (concat my-bibliography-dir "notes.org")
        bibtex-completion-notes-path org-ref-bibliography-notes
        bibtex-completion-pdf-field "file"
        ;; open pdf with system pdf viewer (works on mac)
        bibtex-completion-pdf-open-function
        (lambda (fpath)
          (progn
            (message fpath)
            (start-process "open" "*open*" "open" fpath)))))
   #+end_src

   As we manage references by Zotero, which does not store PDFs in the
   format required by ~org-ref~, we fall back to the
   ~bibtex-completion~ for finding and opening PDFs based on the
   ~file~ field.

    #+begin_src emacs-lisp
      (defun my/org-ref-open-pdf-at-point ()
        "Open the pdf for bibtex key under point if it exists."
        (interactive)
        (org-open-file
         (car (bibtex-completion-find-pdf
               (car (org-ref-get-bibtex-key-and-file))))))
      (setq org-ref-open-pdf-function 'my/org-ref-open-pdf-at-point)
   #+end_src

** Org Babel

   #+begin_src emacs-lisp
       (org-babel-do-load-languages
        'org-babel-load-languages
        '((shell . t)
          (python . t)
          (C . t)))
       (setq org-confirm-babel-evaluate nil)
   #+end_src

** Roam

   # {{{package(org-roam)}}}
   # {{{package(org-roam-bibtex)}}}
   # {{{binding(C-c n l,org-roam)}}}
   # {{{binding(C-c n f,org-roam-find-file)}}}
   # {{{binding(C-c n b,org-roam-switch...)}}}
   # {{{binding(C-c n g,org-roam-show-graph)}}}
   # {{{binding(C-c n i,org-roam-insert)}}}
   # {{{binding(C-c n a,orb-note-actions)}}}

   # #+begin_src emacs-lisp
   #   (use-package org-roam
   #     :straight t
   #     :hook
   #     (after-init . org-roam-mode)
   #     :custom
   #     (org-roam-directory org-directory)
   #     :bind (:map org-roam-mode-map
   #                 (("C-c n l" . org-roam)
   #                  ("C-c n f" . org-roam-find-file)
   #                  ("C-c n b" . org-roam-switch-to-buffer)
   #                  ("C-c n g" . org-roam-show-graph))
   #                 :map org-mode-map
   #                 (("C-c n i" . org-roam-insert))))

   #   (use-package org-roam-bibtex
   #     :straight t
   #     :hook (org-roam-mode . org-roam-bibtex-mode)
   #     :bind (:map org-mode-map
   #            (("C-c n a" . orb-note-actions))))
   # #+end_src

** Homegrown Org Presentations

   {{{binding(C-+,text-scale-increase)}}}
   {{{binding(C--,text-scale-decrease)}}}

   #+begin_src emacs-lisp
     (load "org-present.el")
     (global-set-key (kbd "C-+") 'text-scale-increase)
     (global-set-key (kbd "C--") 'text-scale-decrease)
   #+end_src

** Mac: Open "message" links

   #+begin_src emacs-lisp
     (org-link-set-parameters
      "message"
      :follow
      (lambda (url)
        (let
            ((goto-url (format "message:%s" url)))
          (message "%s" goto-url)
          (browse-url goto-url))))
   #+end_src

** Search with ~org-fts~

   An experimental search solution from https://github.com/zot/microfts

   #+begin_src emacs-lisp
     (require 'ivy-org-fts)
     (setq org-fts-input-args '())
     (define-prefix-command 'ctrl-c-o-map)
     (global-set-key (kbd "C-c o") 'ctrl-c-o-map)
     (global-set-key (kbd "C-c o s") 'ivy-org-fts-search)
     (global-set-key (kbd "C-c o f") 'ivy-org-fts-find-org-file)
   #+end_src


* Other Markup formats

  {{{package(yaml-mode)}}}

  #+begin_src emacs-lisp
    (use-package yaml-mode
      :straight t)
  #+end_src

  PDF tools.

  #+begin_src emacs-lisp
    (use-package pdf-tools
      :straight t
      :magic ("%PDF" . pdf-view-mode)
      :config
      (pdf-tools-install :no-query)
      (setq pdf-view-use-scaling t))
  #+end_src


* Spell checking

  Use ~aspell~, ~enchant~ or ~ispell~ as a spell checker, whichever is
  available on this machine.

  #+begin_src emacs-lisp
    (cond ((executable-find "enchant-2")
           (setq-default ispell-program-name "enchant-2"))
          ((executable-find "aspell")
           (setq-default ispell-program-name "aspell"))
          (t
           (message "Neither enchant nor aspell could be found, falling back to ispell")))
    ;; Make 'ispell-dictionary' safe for local strings, to enable
    ;; setting the spell check language locally in a file
    (put 'ispell-dictionary 'safe-local-variable 'stringp)
    (dolist (hook '(text-mode-hook))
      (add-hook hook (lambda () (flyspell-mode 1))))
    (dolist (hook '(change-log-mode-hook log-edit-mode-hook))
      (add-hook hook (lambda () (flyspell-mode -1))))
  #+end_src

  {{{package(guess-language)}}}
  #+begin_src emacs-lisp
    (use-package guess-language
      :straight t)
  #+end_src

* Programming

ripgrep

{{{package(rg)}}}

#+begin_src emacs-lisp
(use-package rg :straight t)
#+end_src



** Code
*** Projectile

    {{{package(projectile)}}}

  #+begin_src emacs-lisp
    (use-package projectile :straight t)
    (projectile-global-mode)
    (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  #+end_src


*** Subversion

    {{{package(dsvn)}}}

 #+begin_src emacs-lisp
 (use-package dsvn :straight t)
 #+end_src

** Compilation Buffer

   Avoid lagging compilation buffer by removing the particularly
   expensive maven regular expression.

   {{{package(compile)}}}

 #+begin_src emacs-lisp
   (setq compilation-scroll-output t)


   (defun colorize-compilation-buffer ()
     (toggle-read-only)
     (ansi-color-apply-on-region compilation-filter-start (point))
     (toggle-read-only))
   (add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
   (require 'compile)
   (setq compilation-error-regexp-alist
         (delete 'maven compilation-error-regexp-alist))
   (add-to-list
    'compilation-error-regexp-alist-alist
    '(bandit "^ *Location: \\([^:]+\\):\\([0-9]+\\):\\([0-9]+\\)" 1 2 3))
   (add-to-list 'compilation-error-regexp-alist 'bandit)
 #+end_src


** Python

   For editing Python code in Org source blocks, we don't want TABs.

   #+begin_src emacs-lisp
   (add-hook 'org-mode-hook (lambda () (setq indent-tabs-mode nil)))
   #+end_src

   {{{package(blacken)}}}
   #+begin_src emacs-lisp
     (use-package blacken
       :straight t
       :custom
       ;; set this to nil to let black pick up whatever the project
       ;; has configured
       (blacken-line-length nil))
     (global-set-key (kbd "C-c b") 'blacken-buffer)
   #+end_src

   {{{package(pyvenv)}}}

   #+begin_src emacs-lisp
     (use-package pyvenv
       :straight t)
   #+end_src

   {{{package(elpy)}}}
   #+begin_src emacs-lisp
     (use-package elpy
       :straight t
       :custom
       (elpy-formatter "black")
       :init
       (elpy-enable))
   #+end_src

** Additional Keyboard Shortcuts

   {{{package(magit)}}}
   {{{package(forge)}}}
   #+begin_src emacs-lisp
   (use-package magit
     :straight t
     :bind (("C-c s" . magit-status)))
   (use-package forge :after magit
     :straight t
     :config
     (push '("de-git01.contact.de" "de-git01.contact.de/api/v4"
             "de-git01.contact.de" forge-gitlab-repository)
           forge-alist))
   #+end_src

   {{{binding(C-c m,compile)}}}
   {{{binding(C-c n,next-error)}}}
   {{{binding(C-c s,magit-status)}}}

   #+begin_src emacs-lisp
   (global-set-key (kbd "C-c m") 'compile)
   (global-set-key (kbd "C-c n") 'next-error)
   #+end_src

** Javascript

   {{{package(rjsx-mode)}}}
#+begin_src emacs-lisp
  (use-package rjsx-mode
    :straight t)
#+end_src

** Go

   #+begin_src emacs-lisp
     (use-package go-mode
       :straight t)
   #+end_src

* Mail

I (sometimes) read email inside Emacs using ~mu4e~. IMAP accounts are
completely replicated to local storage (~Maildir~) by ~isync~, and
then indexed by ~mu~.

** Installing mu

~mu~ is available from Homebrew. ~mu~ comes with the Emacs package
~mu4e~.

#+begin_src bash :tangle no
$ brew install mu
#+end_src

** Installation and configuration of ~mbsync~

The ~mbsync~ command comes with the ~isync~ package from Homebrew.

#+begin_src sh :tangle no
$ brew install isync
#+end_src

*** Safe passwords

To not expose clear-text passwords in ~.mbsyncrc~ we access mail
account passwords from the OS X keyring. For this, the Python package
~keyring~ is used (installed with ~pipx~).

