emacs/.emacs.d/emacs.el
;;(require 'ox-bibtex)
;; Remove the "cite" entry added by ox-bibtex, otherwise we'll get a
;; warning that it is redefined by org-ref
(setq org-link-parameters
      (assoc-delete-all "cite" org-link-parameters))
(bibtex-set-dialect 'biblatex)
(add-to-list
 'bibtex-biblatex-entry-alist
 '("software" "Software"
   (("title") ("author") ("date") ("url") ("abstract"))
   nil
   "keywords"))
(setq
 my-bibliography-dir (file-name-as-directory "~/References")
 my-bib-file (concat my-bibliography-dir "cslab.bib"))

(use-package org-ref
  :straight t
  :config
  (setq
   reftex-default-bibliography (list my-bib-file)
   org-ref-default-bibliography (list my-bib-file)
   bibtex-completion-bibliography (list my-bib-file)
   org-ref-bibliography-notes (concat my-bibliography-dir "notes.org")
   bibtex-completion-notes-path org-ref-bibliography-notes
   bibtex-completion-pdf-field "file"
   ;; open pdf with system pdf viewer (works on mac)
   bibtex-completion-pdf-open-function
   (lambda (fpath)
     (progn
       (message fpath)
       (start-process "open" "*open*" "open" fpath)))))

(defun my/org-ref-open-pdf-at-point ()
  "Open the pdf for bibtex key under point if it exists."
  (interactive)
  (org-open-file
   (car (bibtex-completion-find-pdf
         (car (org-ref-get-bibtex-key-and-file))))))
(setq org-ref-open-pdf-function 'my/org-ref-open-pdf-at-point)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((shell . t)
   (python . t)
   (C . t)))
(setq org-confirm-babel-evaluate nil)

(load "org-present.el")
(global-set-key (kbd "C-+") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)

(org-link-set-parameters
 "message"
 :follow
 (lambda (url)
   (let
       ((goto-url (format "message:%s" url)))
     (message "%s" goto-url)
     (browse-url goto-url))))

(require 'ivy-org-fts)
(setq org-fts-input-args '())
(define-prefix-command 'ctrl-c-o-map)
(global-set-key (kbd "C-c o") 'ctrl-c-o-map)
(global-set-key (kbd "C-c o s") 'ivy-org-fts-search)
(global-set-key (kbd "C-c o f") 'ivy-org-fts-find-org-file)

(use-package yaml-mode
  :straight t)

(use-package pdf-tools
  :straight t
  :magic ("%PDF" . pdf-view-mode)
  :config
  (pdf-tools-install :no-query)
  (setq pdf-view-use-scaling t))

(cond ((executable-find "enchant-2")
       (setq-default ispell-program-name "enchant-2"))
      ((executable-find "aspell")
       (setq-default ispell-program-name "aspell"))
      (t
       (message "Neither enchant nor aspell could be found, falling back to ispell")))
;; Make 'ispell-dictionary' safe for local strings, to enable
;; setting the spell check language locally in a file
(put 'ispell-dictionary 'safe-local-variable 'stringp)
(dolist (hook '(text-mode-hook))
  (add-hook hook (lambda () (flyspell-mode 1))))
(dolist (hook '(change-log-mode-hook log-edit-mode-hook))
  (add-hook hook (lambda () (flyspell-mode -1))))

(use-package guess-language
  :straight t)

(use-package rg :straight t)

(use-package projectile :straight t)
(projectile-global-mode)
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)

(use-package dsvn :straight t)

(setq compilation-scroll-output t)


(defun colorize-compilation-buffer ()
  (toggle-read-only)
  (ansi-color-apply-on-region compilation-filter-start (point))
  (toggle-read-only))
(add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
(require 'compile)
(setq compilation-error-regexp-alist
      (delete 'maven compilation-error-regexp-alist))
(add-to-list
 'compilation-error-regexp-alist-alist
 '(bandit "^ *Location: \\([^:]+\\):\\([0-9]+\\):\\([0-9]+\\)" 1 2 3))
(add-to-list 'compilation-error-regexp-alist 'bandit)

(add-hook 'org-mode-hook (lambda () (setq indent-tabs-mode nil)))

(use-package blacken
  :straight t
  :custom
  ;; set this to nil to let black pick up whatever the project
  ;; has configured
  (blacken-line-length nil))
(global-set-key (kbd "C-c b") 'blacken-buffer)

(use-package pyvenv
  :straight t)

(use-package elpy
  :straight t
  :custom
  (elpy-formatter "black")
  :init
  (elpy-enable))

(use-package magit
  :straight t
  :bind (("C-c s" . magit-status)))
(use-package forge :after magit
  :straight t
  :config
  (push '("de-git01.contact.de" "de-git01.contact.de/api/v4"
          "de-git01.contact.de" forge-gitlab-repository)
        forge-alist))

(global-set-key (kbd "C-c m") 'compile)
(global-set-key (kbd "C-c n") 'next-error)

(use-package rjsx-mode
  :straight t)

(use-package go-mode
  :straight t)

(when (require 'mu4e nil 'noerror)
  (require 'mu4e)
