emacs/.emacs.d/emacs.el
  (global-set-key (kbd "s-m") 'mu4e))

(setq
 ;; ** General, UI etc.
 mu4e-use-fancy-chars t
 ;; attempt to show images when viewing messages
 mu4e-view-show-images t
 mu4e-headers-include-related nil
 mu4e-confirm-quit nil
 mu4e-attachment-dir "~/Desktop"
 mu4e-headers-date-format "%Y-%m-%d"
 ;;mu4e-html2text-command "textutil -stdin -format html -convert txt -stdout"
 mu4e-html2text-command "/usr/local/bin/w3m -T text/html"
 ;;mu4e-html2text-command "/usr/local/bin/html2text -utf8 -nobs -width 72"
 mu4e-change-filenames-when-moving t
 mu4e-headers-fields (quote
                      ((:human-date . 12)
                       (:flags . 6)
                       (:from-or-to . 22)
                       (:subject)))
 ;;mu4e-mu-binary     "/usr/local/bin/mu"
 ;;mu4e-maildir       "~/.mail"   ;; top-level Maildir
 mu4e-compose-complete-only-after "2014-01-01"
 ;; mu4e-compose-complete-only-personal t
 mu4e-get-mail-command
 "mbsync work:Inbox work:Archive work:Sent gmail:Inbox"
 message-send-mail-function   'smtpmail-send-it
 mu4e-context-policy 'pick-first
 mu4e-compose-context-policy 'ask
 mu4e-maildir-shortcuts '(("/work/Archive" . ?a)
                          ("/work/Inbox"   . ?i)
                          ("/work/Sent"    . ?s)
                          ("/work/Drafts"  . ?d)
                          ("/gmail/Inbox" . ?g))

 ;; a  list of user's e-mail addresses
 mu4e-user-mail-address-list  '("fp@contact.de"
                                "frank.patz-brockmann@contact-software.com"
                                "frank@contact.de"
                                "frank.patz@contact.de"
                                "frank.patz@gmail.com"
                                "frank.patz@googlemail.com")
 )

(setq epa-pinentry-mode 'loopback)
  (when (require 'mu4e nil 'noerror)
    (setq
     mu4e-contexts
     `( ,(make-mu4e-context
          :name "work"
          :enter-func (lambda () (mu4e-message "fp@contact.de"))
          :match-func (lambda (msg)
                        (when msg
                          (mu4e-message-contact-field-matches
                           msg
                           '(:to :from :cc :bcc) "@contact")))
          :vars '(
                  (user-mail-address . "fp@contact.de")
                  (mu4e-reply-to-address . "fp@contact.de")
                  (mu4e-sent-folder . "/work/Sent")
                  (mu4e-drafts-folder . "/work/Drafts")
                  (mu4e-trash-folder . "/work/Gel&APY-schte Elemente")
                  (mu4e-refile-folder . "/work/Archive")
                  (user-full-name . "Frank Patz-Brockmann")
                  (mu4e-compose-signature .
                                          "Frank Patz-Brockmann\nhttp://www.contact-software.com/\n")
                  (smtpmail-smtp-server . "smtp.office365.com")
                  (smtpmail-default-smtp-server . "smtp.office365.com")
                  (smtpmail-queue-mail . nil)
                  (smtpmail-queue-dir . "~/.mail/work/Queue")))
        ,(make-mu4e-context
          :name "gmail"
          :enter-func (lambda () (mu4e-message "frank.patz@gmail.com"))
          :match-func (lambda (msg)
                        (when msg
                          (mu4e-message-contact-field-matches
                           msg
                           '(:to :from :cc :bcc) "@g")))
          :vars '(
                  (user-mail-address . "frank.patz@gmail.com")
                  (user-full-name . "Frank Patz-Brockmann")
                  (mu4e-sent-folder . "/gmail/[Google Mail]/.Gesendet")
                  (mu4e-drafts-folder . "/gmail/[Google Mail]/.Entw&APw-rfe")
                  (mu4e-trash-folder . "/gmail/[Google Mail]/.Papierkorb")
                  (mu4e-refile-folder . "/gmail/[Google Mail]/.Alle Nachrichten")
                  (mu4d-compose-signature . "Frank Patz-Brockmann\nfrank.patz@gmail.com\n")
                  (smtpmail-smtp-server . "smtp.gmail.com")
                  (smtpmail-default-smtp-server . "smtp.gmail.com")
                  (smtpmail-smtp-service . 587)
                  ;; (smtpmail-local-domain . "gmail.com")
                  ;; (smtpmail-queue-mail . nil)
                  ;; (smtpmail-starttls-credentials . '(("smtp.gmail.com" "587" nil nil)))
                  ;; (smtpmail-auth-credentials . (expand-file-name "~/.authinfo"))
                  ;; (starttls-extra-arguments . nil)
                  ;; (starttls-gnutls-program . "/usr/local/bin/gnutls-cli")
                  ;; (starttls-use-gnutls . t)
                  )))
     ))

(when (require 'mu4e nil 'noerror)
  (add-to-list 'mu4e-view-actions
               '("browser view" . mu4e-action-view-in-browser) t)
  (add-to-list 'mu4e-bookmarks
               '("m:/gmail/Inbox OR m:/work/INBOX"       "Unified Inbox"     ?i))
  ;;store org-mode links to messages
  (require 'org-mu4e)
  ;;store link to message if in header view, not to header query
  (setq org-mu4e-link-query-in-headers-mode nil))

(when (require 'mu4e nil 'noerror)
  (setq mail-user-agent 'mu4e-user-agent)
  (setq org-mu4e-convert-to-html t))

(when (require 'mu4e nil 'noerror)
  (defun my-execute-mu4e-marks ()
    "Execute marks in header mode without asking for confirmation"
    (interactive)
    (mu4e-mark-execute-all t))
  (eval-after-load 'mu4e-headers
    '(define-key mu4e-headers-mode-map "x" 'my-execute-mu4e-marks)))

(require 'org-protocol)
(use-package org-capture-pop-frame
  :straight t
  :config
  (setq
   ocpf-frame-parameters
     '((name . "org-capture-pop-frame")
       (width . 121)
       (height . 30)
       (tool-bar-lines . 0)
       (menu-bar-lines . 0))))

(server-start)
(add-to-list 'auto-mode-alist '("\\.jsx$" . web-mode))
(defadvice web-mode-highlight-part (around tweak-jsx activate)
  (if (equal web-mode-content-type "jsx")
      (let ((web-mode-enable-part-face nil))
        ad-do-it)
    ad-do-it))

(setq dired-use-ls-dired nil)

(setq-default indent-tabs-mode nil)
(setq rg-executable-path "rg")
