emacs/.emacs.d/emacs.org
** vterm

{{{package(vterm)}}}

#+begin_src emacs-lisp
  (use-package vterm
    :straight t
    :custom
    (vterm-shell (concat (locate-file "bash" exec-path exec-suffixes 1) " -i")))
#+end_src

* Appendices

#+latex: \printbibliography[heading=bibintoc]
#+latex: \printindex

{{{if-export(html,* References)}}}
{{{if-export(html,#+bibliography: /Users/frank/References/cslab-bibtex.bib alpha limit:t option:-nokeywords)}}}

* To-dos, Issues & Ideas                                            :noexport:

*** TODO Add dockerfile-mode
*** TODO Make xdg-open work from inside Emacs

    https://askubuntu.com/questions/646631/emacs-doesnot-work-with-xdg-open

*** TODO Add binding for activating org-ref-helm-insert-cite-link to rst-mode
*** TODO Mention view-mode
*** TODO Explore one of the git-gutter modes
*** TODO Leave config files in top-level .git
    For Management with magit re-set GIT_DIR
*** TODO rainbow-mode!
*** TODO Checkers
    - writegood-mode
    - language-tool, Emacs langtool
*** TODO sphinx-mode (!)
*** TODO Add org-toc and window-split-toggle

    org-toc displays an outline of the Org document currently open. I
    think I'd like a shortcut for that. Unfortunately, the =*org-toc*=
    buffer comes up in new, /horizontally/ split windows, which I find
    annoying. For that, [[https://emacs.stackexchange.com/questions/5371/how-to-change-emacs-windows-from-vertical-split-to-horizontal-split][this code from an answer from
    emacs.stackexchange]] may help:

    #+begin_src emacs-lisp :tangle no
      (defun window-split-toggle ()
        "Toggle between horizontal and vertical split with two windows."
        (interactive)
        (if (> (length (window-list)) 2)
            (error "Can't toggle with more than 2 windows!")
          (let ((func (if (window-full-height-p)
                          #'split-window-vertically
                        #'split-window-horizontally)))
            (delete-other-windows)
            (funcall func)
            (save-selected-window
              (other-window 1)
              (switch-to-buffer (other-buffer))))))
    #+end_src

    +Maybe+ even better: https://www.emacswiki.org/emacs/TransposeFrame

    Possible key bindings:

    | S-Arrow Down/up    | transpose-frame |
    | S-Arrow Left/right | rotate-frame    |
    |                    |                 |
*** Better key binding for deft: s-d?
*** Consider ol-man (man: links)
*** Option for highlighting CSS in HTML output

    #+begin_example
    span.org-css-selector {
      font-weight: bold;
      color: darkmagenta;
    }
    span.org-css-property {
      color: darkred;
    }
    #+end_example
