emacs/.emacs.d/emacs.el

(use-package vterm
  :straight t
  :custom
  (vterm-shell (concat (locate-file "bash" exec-path exec-suffixes 1) " -i")))
